/****************************************Copyright (c)****************************************************
**                                     艾克姆科技(IKMSIK)   
**                                 淘宝店铺: acmemcu.taobao.com
**                                 技术论坛: 930ebbs.com                             
**
**--------------File Info---------------------------------------------------------------------------------
** File name:		 main.c
** Last modified Date:          
** Last Version:		   
** Descriptions:		   
**				
**--------------------------------------------------------------------------------------------------------
** Created by:			FiYu
** Created date:		2018-1-20
** Version:			    1.0
** Descriptions:		跑马灯（或称为流水灯）
**--------------------------------------------------------------------------------------------------------*/
#include "stm32f10x.h"
//delay这里报错的原因是：delay函数用汇编实现的，导致了MDK误报。
#include "delay.h"
#include "led.h"

//定义一个LED数组，方便循环操作LED
static const uint32_t led_list[LEDS_NUMBER] = {LED_1, LED_2, LED_3, LED_4};


/*******************************************************************************
 * 描  述 : 主函数
 * 参  数 : 无
 * 返回值 : 无
 ******************************************************************************/
int main(void)
{ 
  //初始化用于驱动指示灯D1 D2 D3 D4的引脚PG6 PA8 PB8 PB9
	leds_init();	

  //主循环	
	while(1)
	{	
		//4个LED轮流点亮循环5次
		for(uint8_t i=0; i<LEDS_NUMBER; i++)
		{
			led_on(led_list[i]);
			sw_delay_ms(100); 
			led_off(led_list[i]);
			sw_delay_ms(70); 	
		}
	}
}
/********************************************END FILE************************/


